app/controllers/publications_controller.rb

  def index
    @publications = Publication.all
---
SELECT `publications`.* FROM `publications`

  def show
    @publication = Publication.find(params[:id])
---
SELECT  `publications`.* FROM `publications` WHERE `publications`.`id` = 3 LIMIT 1